/*1953609 软件 王灏廷*/
#include <iostream>
#include <iomanip>
#include <cmath>
using namespace std;
int main()
{
	int x1, y1, x2, y2;
	cout << "请输入第1个点的坐标 : ";
	cin >> x1 >> y1;
	cout << "请输入第2个点的坐标 : ";
	cin >> x2 >> y2;
	if (x1 == x2 || y1 == y2) {
		cout << "不构成三角形" << endl;
	}
	else {
		cout << setiosflags(ios::fixed) << setprecision(3);
		if (1.0 / 2 * (-x1 * 1.0 * (y1 - y2) / (x1 - x2) + y1) * (-y1 * 1.0 * (x1 - x2) / (y1 - y2) + x1) > 0)
			cout << 1.0 / 2 * (-x1 * 1.0 * (y1 - y2) / (x1 - x2) + y1) * (-y1 * 1.0 * (x1 - x2) / (y1 - y2) + x1) << endl;
		else
			cout << 1.0 / 2 * (-x1 * 1.0 * (y1 - y2) / (x1 - x2) + y1) * (-y1 * 1.0 * (x1 - x2) / (y1 - y2) + x1) * (-1) << endl;
	}
	return 0;
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
